benchmark/out/grpc_rps_50_n_3.txt

Summary:
  Count:	150
  Total:	10.00 s
  Slowest:	862.94 ms
  Fastest:	296.07 ms
  Average:	658.28 ms
  Requests/sec:	15.00

Response time histogram:
  296.075 [1]  |∎
  352.761 [0]  |
  409.447 [1]  |∎
  466.133 [1]  |∎
  522.820 [1]  |∎
  579.506 [2]  |∎
  636.192 [16] |∎∎∎∎∎∎∎∎∎∎
  692.878 [63] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  749.565 [35] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  806.251 [16] |∎∎∎∎∎∎∎∎∎∎
  862.937 [4]  |∎∎∎

Latency distribution:
  10 % in 608.82 ms 
  25 % in 648.90 ms 
  50 % in 679.70 ms 
  75 % in 715.63 ms 
  90 % in 759.83 ms 
  95 % in 788.01 ms 
  99 % in 856.98 ms 

Status code distribution:
  [OK]            140 responses   
  [Unavailable]   10 responses    

Error distribution:
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:35976->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:36004->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:36048->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:36032->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:36068->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:35988->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:36016->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:36066->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:36064->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:36076->127.0.0.1:50051: use of closed network connection